# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

# YOLOv8.0n head
# YOLOv8.0n head
head:
  - [-1, 1, DySample, []]                       # 10: 20x20 -> 40x40
  - [[-1, 6], 1, Concat, [1]]                   # 11: Concat 40x40 (10) with 40x40 (P4 from 6)
  - [-1, 3, C2f, [512]]                         # 12: 40x40

  - [-1, 1, DySample, []]                       # 13: 40x40 -> 80x80
  - [[-1, 4], 1, Concat, [1]]                   # 14: Concat 80x80 (13) with 80x80 (P3 from 4)
  - [-1, 3, C2f, [256]]                         # 15: 80x80 (P3/8-small)
  - [-1, 1, EMA, [8]]                           # 16: 80x80

  - [-1, 1, DySample, []]   #17
  - [[-1, 2], 1, Concat, [1]]  # 18 cat backbone P3
  - [-1, 3, C2f, [128] ]  # 19 (P2/4-xsmall)

  - [-1, 1, Conv, [256, 3, 2]]  # 20: 80x80 -> 40x40
  - [[-1, 16], 1, Concat, [1]]  # cat head P5 21
  - [-1, 3, C2f, [256]]  # 22 (P4/16-medium)


  - [-1, 1, Conv, [512, 3, 2]]                  # 23: 80x80 -> 40x40
  - [[-1, 12], 1, Concat, [1]]                  # 24: Concat 40x40 (17) with 40x40 (12)
  - [-1, 3, C2f, [512]]                         # 25: 40x40 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 26: 40x40 -> 20x20
  - [[-1, 9], 1, Concat, [1]]                   # 27: Concat 20x20 (21) with 20x20 (P5 from 9)
  - [-1, 3, C2f, [1024]]                        # 28: 20x20 (P5/32-large)

  - [[19, 22, 25, 28], 1, Detect, [nc]]             # 29: Detect(P3, P4, P5)

