# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs.

# Parameters
nc: 1  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
    # [from, repeats, module, args]
backbone:
    - [-1, 1, Conv, [64, 3, 2]]   # Layer 0: 3 -> 64 channels
    - [-1, 1, EnhancedCBAM, [64]]  # Layer 1: 64 channels
    - [-1, 1, Conv, [128, 3, 2]]  # Layer 2
    - [-1, 3, C2f, [128, True]]   # Layer 3: Output 128 channels
    - [-1, 1, Conv, [256, 3, 2]]  # Layer 4: Output 256 channels
    - [-1, 1, EnhancedCBAM, [256]]  # Layer 5: Input 256 channels
    - [-1, 6, C2f, [256, True]]    # Layer 6: Output 256 channels
    - [-1, 1, Conv, [512, 3, 2]]   # Layer 7: Output 512 channels
    - [-1, 1, EnhancedCBAM, [512]]  # Layer 8: Input 512 channels
    - [-1, 6, C2f, [512, True]]    # Layer 9: Output 512 channels
    - [-1, 1, Conv, [1024, 3, 2]]  # Layer 10: Output 1024 channels
    - [-1, 1, EnhancedCBAM, [1024]]  # Layer 11: Input 1024 channels
    - [-1, 3, C2f, [1024, True]]    # Layer 12: Output 1024 channels
    - [-1, 1, SPPF, [1024, 5]]      # Layer 13: Output 1024 channels

# YOLOv8.0n head
head:
    - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Layer 14
    - [[-1, 9], 1, Concat, [1]]  # Layer 15: Concat 1024 (13) + 512 (9) = 1536 channels
    - [-1, 1, EnhancedCBAM, [1536]]  # Layer 16: Input 1536 channels
    - [-1, 3, C2f, [512]]  # Layer 17: Output 512 channels

    - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Layer 18
    - [[-1, 6], 1, Concat, [1]]  # Layer 19: Concat 512 (17) + 256 (6) = 768 channels
    - [-1, 1, EnhancedCBAM, [768]]  # Layer 20: Input 768 channels
    - [-1, 3, C2f, [256]]  # Layer 21: Output 256 channels (P3/8-small)

    - [-1, 1, Conv, [256, 3, 2]]  # Layer 22: Output 256 channels
    - [[-1, 17], 1, Concat, [1]]  # Layer 23: Concat 256 (22) + 512 (17) = 768 channels
    - [-1, 1, EnhancedCBAM, [768]]  # Layer 24: Input 768 channels
    - [-1, 3, C2f, [512]]  # Layer 25: Output 512 channels (P4/16-medium)

    - [-1, 1, Conv, [512, 3, 2]]  # Layer 26: Output 512 channels
    - [[-1, 13], 1, Concat, [1]]  # Layer 27: Concat 512 (26) + 1024 (13) = 1536 channels
    - [-1, 1, EnhancedCBAM, [1536]]  # Layer 28: Input 1536 channels
    - [-1, 3, C2f, [1024]]  # Layer 29: Output 1024 channels (P5/32-large)

    - [[21, 25, 29], 1, Detect, [nc]]  # Detect(P3, P4, P5)