# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

# YOLOv8.0n head
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10: 20x20 -> 40x40
  - [[-1, 6], 1, Concat, [1]]                   # 11: Concat 40x40 (10) with 40x40 (P4 from 6)
  - [-1, 3, C2f, [512]]                         # 12: 40x40

  - [-1, 1, Conv, [256, 1, 1]] # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14: 40x40 -> 80x80
  - [[-1, 4], 1, BiFPN_Concat, [128, 128]]                   # 15: Concat 80x80 (13) with 80x80 (P3 from 4)
  - [-1, 3, C2f, [256]]                         # 16: 80x80 (P3/8-small)
  - [-1, 1, EMA, [8]]                           # 17: 80x80

  - [-1, 1, Conv, [256, 3, 2]]                  # 17: 80x80 -> 40x40
  - [[-1, 12], 1, Concat, [1]]                  # 18: Concat 40x40 (17) with 40x40 (12)
  - [-1, 3, C2f, [512]]                         # 19: 40x40 (P4/16-medium)
#  - [-1, 1, EMA, [8]]                         # 20: 40x40 (commented out)

  - [-1, 1, Conv, [512, 3, 2]]                  # 21: 40x40 -> 20x20
  - [[-1, 9], 1, Concat, [1]]                   # 22: Concat 20x20 (21) with 20x20 (P5 from 9)
  - [-1, 3, C2f, [1024]]                        # 23: 20x20 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]             # 24: Detect(P3, P4, P5)

#head:
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#  - [[-1, 6], 1, Concat_BiFPN, [1]]  # cat backbone P4
#  - [-1, 3, C2f, [512]]  # 12
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#  - [[-1, 4], 1, Concat_BiFPN, [1]]  # cat backbone P3
#  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)
#
#  - [-1, 1, Conv, [256, 3, 2]]
#  - [[-1, 12], 1, Concat_BiFPN, [1]]  # cat head P4
#  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)
#
#  - [-1, 1, Conv, [512, 3, 2]]
#  - [[-1, 9], 1, Concat, [1]]  # cat head P5
#  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)
#
#  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)