# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0s head
head:
  - [[4, 6], 1, ASFF_2, [0]]  # 10
  - [-1, 3, C2f, [ 64 ]]  # 12

  - [[4, 6], 1, ASFF_2, [1]]  # 13
  - [-1, 3, C2f, [128]]  # 17 (P3/8-small)

  - [[-3, -1, 9], 1, ASFF_3, [0]]  # 18
  - [-1, 3, C2f, [64]]  # 20 (P4/16-medium)

  - [[-5, -3, 9], 1, ASFF_3, [1]]
  - [-1, 3, C2f, [128]]  # 23 (P5/32-large)

  - [[-7, -5, 9], 1, ASFF_3, [2]]
  - [-1, 3, C2f, [256]]  # 23 (P5/32-large)

  - [[15, 17, 19], 1, Detect, [nc]]  # Detect(P3, P4, P5)